tests/load/scenarios/auth-load.yml
# Authentication Service Load Test
# Tests authentication endpoints under load

config:
  target: "http://localhost:3000"

  plugins:
    expect: {}
    metrics-by-endpoint: {}

  phases:
    - duration: 30
      arrivalRate: 10
      name: "Warm-up"
    - duration: 60
      arrivalRate: 10
      rampTo: 100
      name: "Ramp-up"
    - duration: 120
      arrivalRate: 100
      name: "Peak Load"
    - duration: 30
      arrivalRate: 20
      name: "Cool-down"

  payload:
    path: "../data/users.csv"
    fields:
      - "email"
      - "password"
    skipHeader: true
    loadAll: true

  http:
    timeout: 30
    maxSockets: 300

  ensure:
    p95: 500
    p99: 1000
    maxErrorRate: 2

scenarios:
  # Standard login flow
  - name: "User Login"
    weight: 40
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.data.accessToken"
              as: "token"
          expect:
            - statusCode: 200
            - hasProperty: "data.accessToken"

  # Login + Get Me flow
  - name: "Login and Get Profile"
    weight: 30
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.data.accessToken"
              as: "token"
            - json: "$.data.user.tenantId"
              as: "tenantId"
          expect:
            - statusCode: 200
      - get:
          url: "/api/auth/me"
          headers:
            Authorization: "Bearer {{ token }}"
            X-Tenant-ID: "{{ tenantId }}"
          expect:
            - statusCode: 200

  # Token refresh flow
  - name: "Token Refresh"
    weight: 20
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.data.accessToken"
              as: "token"
            - json: "$.data.refreshToken"
              as: "refreshToken"
          expect:
            - statusCode: 200
      - think: 2
      - post:
          url: "/api/auth/refresh"
          json:
            refreshToken: "{{ refreshToken }}"
          expect:
            - statusCode: 200

  # Invalid login attempts (rate limiting test)
  - name: "Invalid Login"
    weight: 10
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "invalid@test.com"
            password: "wrongpassword"
          expect:
            - statusCode:
                - 401
                - 429